post/org-publish-blog.org
#+title: 使用 org-publish 发布博客
#+date: <2024-09-27 Fri>

博客经历过几次更新，最开始的时候是用 markdown 写博客，然后用 [[https://hexo.io/][Hexo]] 发布。

然后学习了 Vue，又尝试用 [[https://vuepress.vuejs.org/][VuePress]] 发布，它们都是托管在 [[https://pages.github.com/][Github Pages]] 上。

后来接触了 [[https://www.gnu.org/software/emacs/][Emacs]]，就从 markdown 迁移到了 [[https://orgmode.org/][org-mode]]，然后使用 [[https://gohugo.io/][Hugo]] [fn:1]发布。

因为 GitHub 直连变慢了，所以将内容托管到了 [[https://vercel.com/][Vercel]] 和 [[https://www.netlify.com/][Netlify]]。

最近将博客又更新了一下，使用 [[https://orgmode.org/manual/Publishing.html][org-publish]] 进行博客的发布，主要是让博客加载相对快一些，维护起来更简单一些。

* 动机

在很早之前看过几篇文章：

- [[http://motherfuckingwebsite.com/][mother fucking website]]

- [[http://bettermotherfuckingwebsite.com/][better mother fucking website]]

- [[https://thebestmotherfucking.website/][the best mother fucking website]]

设计复杂的网站，在网络较差的情况下有可能要加载很久才能显示。

如果样式比较复杂， 在一些小屏幕下的显示可能不好。

所以作者提出网站要保持简洁，这次也主要是基于作者提出的建议修改了网站。

* 相比之前的变化

- 极大的简化了博客内容，没有主题，没有模板，只有博客内容的 org 文件、css 文件、字体、图片，以及最终转换出来的 HTML 文件

- 博客的编写、构建只需要 Emacs 就能完成（以及 [[https://browsersync.io/][Browsersync]] 用于本地查看构建的 HTML）

- 转换后就是标准的 HTML，而且是使用 Emacs 内置的包转换 org 文件，理论上 org 的特性应该都能转换

- 按照  [[http://bettermotherfuckingwebsite.com/][better mother fucking website]] 和 [[https://thebestmotherfucking.website/][the best mother fucking website]] 的建议，设置了字体颜色，字体大小，链接颜色，行间距，行宽等，比默认的浏览器样式好阅读一些

- 使用 [[https://www.brailleinstitute.org/freefont/][Atkinson Hyperlegible]] 字体，让一些容易混淆的字符更容易区分

总而言之，就是清爽了很多，兼容性也应该不错。

