publish/org-publish-blog.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>使用 org-publish 发布博客</title>
<meta name="author" content="Spike Leung" />
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="../styles/style.css" type="text/css"/>
<link rel="stylesheet" href="https://chinese-fonts-cdn.deno.dev/packages/lxgwwenkai/dist/LXGWWenKai-Regular/result.css" />
<link rel="icon" href="/favicon.ico" type="image/x-icon">
</head>
<body>
<div id="preamble" class="status">

 <nav>
  <ul>
    <li><a href="/index.html">Home</a></li>
    <li><a href="/about.html">About</a></li>
    <li><a href="/rss.xml">RSS</a></li>
    <li><a href="https://github.com/Spike-Leung/taxodium/tree/org-publish">GitHub</a></li>
    <li><a href="https://music.163.com/#/playlist?id=12531191848">Playlist</a></li>
    <li><a href="/_blank.html">_blank</a></li>
  </ul>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">使用 org-publish 发布博客</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org490fc1d">动机</a></li>
<li><a href="#org5e89e7f">相比之前的变化</a></li>
<li><a href="#org5493eea">org-publish 的使用</a></li>
<li><a href="#org0d25261">org-publish 的完整代码</a></li>
<li><a href="#org4c8e49d">一些缺点</a></li>
<li><a href="#org01d0a59">其他</a></li>
<li><a href="#org1a759fe"><span class="todo TODO">TODO</span> Todo</a></li>
<li><a href="#org01fea98">Refs</a></li>
</ul>
</div>
</nav>
<p>
博客经历过几次更新，最开始的时候是用 markdown 写博客，然后用 <a href="https://hexo.io/">Hexo</a> 发布。
</p>

<p>
然后学习了 Vue，又尝试用 <a href="https://vuepress.vuejs.org/">VuePress</a> 发布，它们都是托管在 <a href="https://pages.github.com/">Github Pages</a> 上。
</p>

<p>
后来接触了 <a href="https://www.gnu.org/software/emacs/">Emacs</a>，就从 markdown 迁移到了 <a href="https://orgmode.org/">org-mode</a>，然后使用 <a href="https://gohugo.io/">Hugo</a> <sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>发布。
</p>

<p>
因为 GitHub 直连变慢了，所以将内容托管到了 <a href="https://vercel.com/">Vercel</a> 和 <a href="https://www.netlify.com/">Netlify</a>。
</p>

<p>
最近将博客又更新了一下，使用 <a href="https://orgmode.org/manual/Publishing.html">org-publish</a> 进行博客的发布，主要是让博客加载相对快一些，维护起来更简单一些。
</p>

<div id="outline-container-org490fc1d" class="outline-2">
<h2 id="org490fc1d">动机</h2>
<div class="outline-text-2" id="text-org490fc1d">
<p>
在很早之前看过几篇文章：
</p>

<ul class="org-ul">
<li><a href="http://motherfuckingwebsite.com/">mother fucking website</a></li>

<li><a href="http://bettermotherfuckingwebsite.com/">better mother fucking website</a></li>

<li><a href="https://thebestmotherfucking.website/">the best mother fucking website</a></li>
</ul>

<p>
设计复杂的网站，在网络较差的情况下有可能要加载很久才能显示。
</p>

<p>
如果样式比较复杂， 在一些小屏幕下的显示可能不好。
</p>

<p>
所以作者提出网站要保持简洁，这次也主要是基于作者提出的建议修改了网站。
</p>
</div>
</div>

<div id="outline-container-org5e89e7f" class="outline-2">
<h2 id="org5e89e7f">相比之前的变化</h2>
<div class="outline-text-2" id="text-org5e89e7f">
<ul class="org-ul">
<li>极大的简化了博客内容，没有主题，没有模板，只有博客内容的 org 文件、css 文件、字体、图片，以及最终转换出来的 HTML 文件</li>

<li>博客的编写、构建只需要 Emacs 就能完成（以及 <a href="https://browsersync.io/">Browsersync</a> 用于本地查看构建的 HTML）</li>

<li>转换后就是标准的 HTML，而且是使用 Emacs 内置的包转换 org 文件，理论上 org 的特性应该都能转换</li>

<li>按照  <a href="http://bettermotherfuckingwebsite.com/">better mother fucking website</a> 和 <a href="https://thebestmotherfucking.website/">the best mother fucking website</a> 的建议，设置了字体颜色，字体大小，链接颜色，行间距，行宽等，比默认的浏览器样式好阅读一些</li>

<li>使用 <a href="https://www.brailleinstitute.org/freefont/">Atkinson Hyperlegible</a> 字体，让一些容易混淆的字符更容易区分</li>
</ul>

<p>
总而言之，就是清爽了很多，兼容性也应该不错。
</p>
</div>
</div>
