post/org-publish-blog.org
* org-publish 的使用

org-publish 的使用有点像 [[https://gulpjs.com/][gulp]]，你可以定义很多个任务，每个任务指定处理什么文件，怎么处理，处理之后放到什么地方。

你可以单独地执行某个任务，也可以将任务串联起来执行。

过程中碰到的几个问题：

- *构建后代码块的高亮* ::
  高亮的颜色是基于 Emacs 当前的主题的，而我的博客整体是亮色的，因此需要 Emacs 中也使用亮色的主题才能得到合适的高亮颜色。

    为此写了 =spike-leung/apply-theme-when-publish= 用于在执行 =org-publish= 的时候切换主题。

- *RSS 的设置* ::
  [[https://github.com/emacsmirror/ox-rss][ox-rss]] 可以生成 RSS 文件，但它是针对一个 org 文件的，对于多个 org 文件，它会分别生成 RSS。

  但是我需要的是把多个 org 文件生成为一个 RSS 文件。

  不过别人已经踩过坑，按照 [[https://writepermission.com/org-blogging-rss-feed.html][Org mode blogging: RSS feed]] 中的方法实现了。

  具体来说就是遍历所有的 org 文件，将他们的内容插入到一个 rss.org 文件中，再基于 rss.org 使用 ox-rss 去生成 RSS 文件。

  [[https://writepermission.com/org-blogging-rss-feed.html][Org mode blogging: RSS feed]] 的实现会把整个 org 文件的内容插入到 rss.org 中。

  但是如果内容很多时，Emacs 会崩溃，我目前是改成只插入标题，后面再研究一下如何优化。

  如果执行 RSS 构建后，发现新写的文章不在 RSS 中，也可能是缓存问题，可以尝试：
  + 删除 =org-publish-timestamp-directory= 中 RSS 的 cache

  + 删除博客相关的 buffer 试试（或者删除全部 buffer）

  + 检查一下是不是 =:exclude= 正则表达式写得有问题

- *index 文件的设置* ::
  设置 =:makeindex t= 可以生成 index 文件，需要在 org 文件中设置 =#+INDEX= keyword。

  但是生成的文件名固定是 theindex.org, 并且会按照文章标题首个字进行索引，看起来很怪，最后用 sitemap 替代了。

  现在看到的 [[https://taxodium.ink/index.html][Home]] 其实就是一个 sitemap。

- =#+date= *的设置* ::
  原来 Hugo 生成的日期 (2023-05-31T13:38:39+08:00) 在转换成 sitemap 的时候似乎不能识别，

  于是改成 org 的日期格式 (<2023-05-31 Wed>)，这样 sitemap 就能正常按照时间排序了。

- *缓存问题* ::
  执行 org-publish 之后，会在 =org-publish-timestamp-directory= 指定的目录下生成缓存，有时调整了页眉页脚，可能需要清除缓存才能看到效果。

  不过可以执行 =C-u M-x org-publish= 忽略缓存进行构建。

- :time-stamp-file nil ::
  设置 =:time-stamp-file nil= 可以避免每次执行 org-publish 的时候都往 HTML 插入最新的时间戳，导致每次变更的文件很多。

- =:html-head= ， =:html-preamble= ， =:html-postamble= 的复用 ::
  最开始定义 =org-publish-project-alist= ， 我是这么写的，导致一直无法使用变量抽象一些公用的 string：

  #+begin_src elisp
    (defconst spike-leung/html-head "
      <link rel=\"stylesheet\" href=\"../styles/style.css\" type=\"text/css\"/>
      <link rel=\"icon\" href=\"/favicon.ico\" type=\"image/x-icon\">
      "
      "`:html-head' for `org-publish'.")

    (setq org-publish-project-alist
          '(("orgfiles"
             :base-directory "~/git/taxodium/post"
             :base-extension "org"
             :html-head ,spike-leung/html-head
             ;; ... 还有其他很多设置
             )))
  #+end_src

  我在这里用的是 ='= 去定义， ='= 在 elisp 中的作用是：

  #+begin_quote
  The special form quote returns its single argument, as written, without evaluating it.

  This provides a way to include constant symbols and lists, which are not self-evaluating objects, in a program.

  [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Quoting.html][Quoting]]
  #+end_quote

  因此 =,spike-leung/html-head= 会被当作一个常量，而不会被执行， 而 =,spike-leung/html-head= 这个字符串 =:html-head= 并不认识。

  要让 =,spike-leung/html-head= 被执行，需要将 ='= 换成 =`= :

  #+begin_src diff
    (defconst spike-leung/html-head "
      <link rel=\"stylesheet\" href=\"../styles/style.css\" type=\"text/css\"/>
      <link rel=\"icon\" href=\"/favicon.ico\" type=\"image/x-icon\">
      "
      "`:html-head' for `org-publish'.")

    (setq org-publish-project-alist
-          '(("orgfiles"
+          `(("orgfiles"
             :base-directory "~/git/taxodium/post"
             :base-extension "org"
             :html-head ,spike-leung/html-head
             ;; ... 还有其他很多设置
             )))
  #+end_src

  #+begin_quote
  Backquote constructs allow you to quote a list, but selectively evaluate elements of that list.

  In the simplest case, it is identical to the special form quote (described in the previous section; see [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Quoting.html][Quoting]]).

  ...

  The special marker ‘,’ inside of the argument to backquote indicates a value that isn’t constant.

  The Emacs Lisp evaluator evaluates the argument of ‘,’, and puts the value in the list structure.

  [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Backquote.html][Backquote]]
  #+end_quote

  =`= 和 ='= 的不同是，它会执行 list 里面的内容， 这样 =,spike-leung/html-head= 就会被执行并返回对应的 string，满足 =:html-head= 的需要。

- 代码块的收起展开 ::
  需要开启 =org-html-html5-fancy= ([[https://orgmode.org/manual/HTML-doctypes.html][13.9.3 HTML doctypes ¶]])，从而可以使用 [[https://developer.mozilla.org/en-US/docs/Web/HTML/Element/details][<details>]]
  #+begin_src elisp
    (setq org-html-html5-fancy t)
    (setq org-html-doctype "html5")
  #+end_src

  然后就可以这么用：

  #+begin_example
    ,#+begin_details
    ,#+HTML: <summary>Demo Code</summary>
    ,#+begin_src JavaScript
    console.log('Hello world!')
    ,#+end_src
    ,#+end_details
  #+end_example

