publish/org-publish-blog.html

<div id="outline-container-org5493eea" class="outline-2">
<h2 id="org5493eea">org-publish 的使用</h2>
<div class="outline-text-2" id="text-org5493eea">
<p>
org-publish 的使用有点像 <a href="https://gulpjs.com/">gulp</a>，你可以定义很多个任务，每个任务指定处理什么文件，怎么处理，处理之后放到什么地方。
</p>

<p>
你可以单独地执行某个任务，也可以将任务串联起来执行。
</p>

<p>
过程中碰到的几个问题：
</p>

<dl class="org-dl">
<dt><b>构建后代码块的高亮</b></dt><dd><p>
高亮的颜色是基于 Emacs 当前的主题的，而我的博客整体是亮色的，因此需要 Emacs 中也使用亮色的主题才能得到合适的高亮颜色。
</p>

<p>
为此写了 <code>spike-leung/apply-theme-when-publish</code> 用于在执行 <code>org-publish</code> 的时候切换主题。
</p></dd>

<dt><b>RSS 的设置</b></dt><dd><p>
<a href="https://github.com/emacsmirror/ox-rss">ox-rss</a> 可以生成 RSS 文件，但它是针对一个 org 文件的，对于多个 org 文件，它会分别生成 RSS。
</p>

<p>
但是我需要的是把多个 org 文件生成为一个 RSS 文件。
</p>

<p>
不过别人已经踩过坑，按照 <a href="https://writepermission.com/org-blogging-rss-feed.html">Org mode blogging: RSS feed</a> 中的方法实现了。
</p>

<p>
具体来说就是遍历所有的 org 文件，将他们的内容插入到一个 rss.org 文件中，再基于 rss.org 使用 ox-rss 去生成 RSS 文件。
</p>

<p>
<a href="https://writepermission.com/org-blogging-rss-feed.html">Org mode blogging: RSS feed</a> 的实现会把整个 org 文件的内容插入到 rss.org 中。
</p>

<p>
但是如果内容很多时，Emacs 会崩溃，我目前是改成只插入标题，后面再研究一下如何优化。
</p>

<p>
如果执行 RSS 构建后，发现新写的文章不在 RSS 中，也可能是缓存问题，可以尝试：
</p>
<ul class="org-ul">
<li>删除 <code>org-publish-timestamp-directory</code> 中 RSS 的 cache</li>

<li>删除博客相关的 buffer 试试（或者删除全部 buffer）</li>

<li>检查一下是不是 <code>:exclude</code> 正则表达式写得有问题</li>
</ul></dd>

<dt><b>index 文件的设置</b></dt><dd><p>
设置 <code>:makeindex t</code> 可以生成 index 文件，需要在 org 文件中设置 <code>#+INDEX</code> keyword。
</p>

<p>
但是生成的文件名固定是 theindex.org, 并且会按照文章标题首个字进行索引，看起来很怪，最后用 sitemap 替代了。
</p>

<p>
现在看到的 <a href="https://taxodium.ink/index.html">Home</a> 其实就是一个 sitemap。
</p></dd>

<dt><code>#+date</code> <b>的设置</b></dt><dd><p>
原来 Hugo 生成的日期 (2023-05-31T13:38:39+08:00) 在转换成 sitemap 的时候似乎不能识别，
</p>

<p>
于是改成 org 的日期格式 (<span class="timestamp-wrapper"><span class="timestamp">&lt;2023-05-31 Wed&gt;</span></span>)，这样 sitemap 就能正常按照时间排序了。
</p></dd>

<dt><b>缓存问题</b></dt><dd><p>
执行 org-publish 之后，会在 <code>org-publish-timestamp-directory</code> 指定的目录下生成缓存，有时调整了页眉页脚，可能需要清除缓存才能看到效果。
</p>

<p>
不过可以执行 <code>C-u M-x org-publish</code> 忽略缓存进行构建。
</p></dd>

<dt>:time-stamp-file nil</dt><dd>设置 <code>:time-stamp-file nil</code> 可以避免每次执行 org-publish 的时候都往 HTML 插入最新的时间戳，导致每次变更的文件很多。</dd>

<dt><code>:html-head</code> ， <code>:html-preamble</code> ， <code>:html-postamble</code> 的复用</dt><dd><p>
最开始定义 <code>org-publish-project-alist</code> ， 我是这么写的，导致一直无法使用变量抽象一些公用的 string：
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #000000;">(</span><span style="color: #531ab6;">defconst</span> <span style="color: #005e8b;">spike-leung/html-head</span> <span style="color: #3548cf;">"</span>
<span style="color: #3548cf;">  &lt;link rel=</span><span style="color: #721045;">\</span><span style="color: #00663f;">"</span><span style="color: #3548cf;">stylesheet</span><span style="color: #721045;">\</span><span style="color: #00663f;">"</span><span style="color: #3548cf;"> href=</span><span style="color: #721045;">\</span><span style="color: #00663f;">"</span><span style="color: #3548cf;">../styles/style.css</span><span style="color: #721045;">\</span><span style="color: #00663f;">"</span><span style="color: #3548cf;"> type=</span><span style="color: #721045;">\</span><span style="color: #00663f;">"</span><span style="color: #3548cf;">text/css</span><span style="color: #721045;">\</span><span style="color: #00663f;">"</span><span style="color: #3548cf;">/&gt;</span>
<span style="color: #3548cf;">  &lt;link rel=</span><span style="color: #721045;">\</span><span style="color: #00663f;">"</span><span style="color: #3548cf;">icon</span><span style="color: #721045;">\</span><span style="color: #00663f;">"</span><span style="color: #3548cf;"> href=</span><span style="color: #721045;">\</span><span style="color: #00663f;">"</span><span style="color: #3548cf;">/favicon.ico</span><span style="color: #721045;">\</span><span style="color: #00663f;">"</span><span style="color: #3548cf;"> type=</span><span style="color: #721045;">\</span><span style="color: #00663f;">"</span><span style="color: #3548cf;">image/x-icon</span><span style="color: #721045;">\</span><span style="color: #00663f;">"</span><span style="color: #3548cf;">&gt;</span>
<span style="color: #3548cf;">  "</span>
  <span style="color: #2a5045;">"`</span><span style="color: #0000b0;">:html-head</span><span style="color: #2a5045;">' for `</span><span style="color: #0000b0;">org-publish</span><span style="color: #2a5045;">'."</span><span style="color: #000000;">)</span>

<span style="color: #000000;">(</span><span style="color: #531ab6;">setq</span> org-publish-project-alist
      <span style="color: #531ab6;">'</span><span style="color: #dd22dd;">(</span><span style="color: #008899;">(</span><span style="color: #3548cf;">"orgfiles"</span>
         <span style="color: #8f0075;">:base-directory</span> <span style="color: #3548cf;">"~/git/taxodium/post"</span>
         <span style="color: #8f0075;">:base-extension</span> <span style="color: #3548cf;">"org"</span>
         <span style="color: #8f0075;">:html-head</span> ,spike-leung/html-head
         <span style="color: #969896;">;; </span><span style="color: #7f0000;">... &#36824;&#26377;&#20854;&#20182;&#24456;&#22810;&#35774;&#32622;</span>
         <span style="color: #008899;">)</span><span style="color: #dd22dd;">)</span><span style="color: #000000;">)</span>
</pre>
</div>

<p>
我在这里用的是 <code>'</code> 去定义， <code>'</code> 在 elisp 中的作用是：
</p>

<blockquote>
<p>
The special form quote returns its single argument, as written, without evaluating it.
</p>

<p>
This provides a way to include constant symbols and lists, which are not self-evaluating objects, in a program.
</p>

<p>
<a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Quoting.html">Quoting</a>
</p>
</blockquote>

<p>
因此 <code>,spike-leung/html-head</code> 会被当作一个常量，而不会被执行， 而 <code>,spike-leung/html-head</code> 这个字符串 <code>:html-head</code> 并不认识。
</p>

<p>
要让 <code>,spike-leung/html-head</code> 被执行，需要将 <code>'</code> 换成 <code>`</code> :
</p>

<div class="org-src-container">
<pre class="src src-diff">    (defconst spike-leung/html-head "
      &lt;link rel=\"stylesheet\" href=\"../styles/style.css\" type=\"text/css\"/&gt;
      &lt;link rel=\"icon\" href=\"/favicon.ico\" type=\"image/x-icon\"&gt;
      "
      "`:html-head' for `org-publish'.")

    (setq org-publish-project-alist
<span style="color: #d00000;">-</span><span style="color: #a60000;">          '(("orgfiles"</span>
<span style="color: #008900;">+</span><span style="color: #006800;">          `(("orgfiles"</span>
             :base-directory "~/git/taxodium/post"
             :base-extension "org"
             :html-head ,spike-leung/html-head
             ;; ... &#36824;&#26377;&#20854;&#20182;&#24456;&#22810;&#35774;&#32622;
             )))
</pre>
</div>

<blockquote>
<p>
Backquote constructs allow you to quote a list, but selectively evaluate elements of that list.
</p>

<p>
In the simplest case, it is identical to the special form quote (described in the previous section; see <a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Quoting.html">Quoting</a>).
</p>

<p>
&#x2026;
</p>

<p>
The special marker ‘,’ inside of the argument to backquote indicates a value that isn’t constant.
</p>

<p>
The Emacs Lisp evaluator evaluates the argument of ‘,’, and puts the value in the list structure.
</p>

<p>
<a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Backquote.html">Backquote</a>
</p>
</blockquote>

<p>
<code>`</code> 和 <code>'</code> 的不同是，它会执行 list 里面的内容， 这样 <code>,spike-leung/html-head</code> 就会被执行并返回对应的 string，满足 <code>:html-head</code> 的需要。
</p></dd>

<dt>代码块的收起展开</dt><dd><p>
需要开启 <code>org-html-html5-fancy</code> (<a href="https://orgmode.org/manual/HTML-doctypes.html">13.9.3 HTML doctypes ¶</a>)，从而可以使用 <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/details">&lt;details&gt;</a>
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #000000;">(</span><span style="color: #531ab6;">setq</span> org-html-html5-fancy t<span style="color: #000000;">)</span>
<span style="color: #000000;">(</span><span style="color: #531ab6;">setq</span> org-html-doctype <span style="color: #3548cf;">"html5"</span><span style="color: #000000;">)</span>
</pre>
</div>

<p>
然后就可以这么用：
</p>

<pre class="example" id="org68356a6">
#+begin_details
#+HTML: &lt;summary&gt;Demo Code&lt;/summary&gt;
#+begin_src JavaScript
console.log('Hello world!')
#+end_src
#+end_details
</pre></dd>
</dl>
</div>
</div>
