publish/org-publish-blog.html

<div id="outline-container-org0d25261" class="outline-2">
<h2 id="org0d25261">org-publish 的完整代码</h2>
<div class="outline-text-2" id="text-org0d25261">
<p>
以下代码可以作为参考，最新的请看 <a href="https://github.com/Spike-Leung/emacs.d/blob/main/lisp/my-lisp/init-org-publish.el">init-org-publish.el</a>。
</p>

<details id="org94c21d3">
<summary>init-org-publish.el</summary>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #969896;">;;; </span><span style="color: #7f0000;">init-org-publish.el --- org publish config for my blog -*- lexical-binding: t -*-</span>
<span style="color: #969896;">;;; </span><span style="color: #7f0000;">Commentary:</span>
<span style="color: #969896;">;;; </span><span style="color: #7f0000;">Code:</span>

<span style="color: #000000;">(</span>maybe-require-package <span style="color: #531ab6;">'</span><span style="color: #0000b0;">ox-rss</span><span style="color: #000000;">)</span>

<span style="color: #000000;">(</span><span style="color: #531ab6;">defun</span> <span style="color: #721045;">spike-leung/apply-theme-when-publish</span> <span style="color: #dd22dd;">(</span><span style="color: #005f5f;">&amp;rest</span> args<span style="color: #dd22dd;">)</span>
  <span style="color: #2a5045;">"Switch theme when do `</span><span style="color: #0000b0;">org-publish</span><span style="color: #2a5045;">'.</span>
<span style="color: #2a5045;">ARGS will pass to `</span><span style="color: #0000b0;">org-publish</span><span style="color: #2a5045;">'."</span>
  <span style="color: #dd22dd;">(</span><span style="color: #531ab6;">let</span> <span style="color: #008899;">(</span><span style="color: #972500;">(</span>current-theme <span style="color: #808000;">(</span>car custom-enabled-themes<span style="color: #808000;">)</span><span style="color: #972500;">)</span><span style="color: #008899;">)</span>
    <span style="color: #008899;">(</span>load-theme <span style="color: #531ab6;">'</span><span style="color: #0000b0;">modus-operandi-tinted</span> t<span style="color: #008899;">)</span>
    <span style="color: #008899;">(</span>apply args<span style="color: #008899;">)</span>
    <span style="color: #008899;">(</span><span style="color: #531ab6;">when</span> current-theme
      <span style="color: #972500;">(</span>disable-theme <span style="color: #531ab6;">'</span><span style="color: #0000b0;">modus-operandi-tinted</span><span style="color: #972500;">)</span>
      <span style="color: #972500;">(</span>enable-theme current-theme<span style="color: #972500;">)</span>
      <span style="color: #972500;">(</span>load-theme current-theme <span style="color: #8f0075;">:no-confirm</span><span style="color: #972500;">)</span><span style="color: #008899;">)</span><span style="color: #dd22dd;">)</span><span style="color: #000000;">)</span>

<span style="color: #000000;">(</span>advice-add <span style="color: #531ab6;">'</span><span style="color: #0000b0;">org-publish</span> <span style="color: #8f0075;">:around</span> <span style="color: #531ab6;">#'</span><span style="color: #0000b0;">spike-leung/apply-theme-when-publish</span><span style="color: #000000;">)</span>


<span style="color: #000000;">(</span><span style="color: #531ab6;">defun</span> <span style="color: #721045;">spike-leung/get-org-keyword</span> <span style="color: #dd22dd;">(</span>keyword<span style="color: #dd22dd;">)</span>
  <span style="color: #2a5045;">"Get the value of the given KEYWORD in the current Org file."</span>
  <span style="color: #dd22dd;">(</span><span style="color: #531ab6;">let</span> <span style="color: #008899;">(</span><span style="color: #972500;">(</span>keywords <span style="color: #808000;">(</span>org-collect-keywords <span style="color: #531ab6;">(</span>list keyword<span style="color: #531ab6;">)</span><span style="color: #808000;">)</span><span style="color: #972500;">)</span><span style="color: #008899;">)</span>
    <span style="color: #008899;">(</span><span style="color: #531ab6;">if-let</span> <span style="color: #972500;">(</span><span style="color: #808000;">(</span>value <span style="color: #531ab6;">(</span>car <span style="color: #008900;">(</span>cdr <span style="color: #3548cf;">(</span>assoc keyword keywords<span style="color: #3548cf;">)</span><span style="color: #008900;">)</span><span style="color: #531ab6;">)</span><span style="color: #808000;">)</span><span style="color: #972500;">)</span>
        value
      <span style="color: #972500;">(</span>format <span style="color: #3548cf;">"No %s found"</span> keyword<span style="color: #972500;">)</span><span style="color: #008899;">)</span><span style="color: #dd22dd;">)</span><span style="color: #000000;">)</span>


<span style="color: #000000;">(</span><span style="color: #531ab6;">defun</span> <span style="color: #721045;">spike-leung/org-publish-find-date</span> <span style="color: #dd22dd;">(</span>file project<span style="color: #dd22dd;">)</span>
  <span style="color: #2a5045;">"Extract `#+date` form org file.</span>
<span style="color: #2a5045;">FILE is org file name.</span>
<span style="color: #2a5045;">PROJECT is the current project.</span>
<span style="color: #2a5045;">"</span>
  <span style="color: #dd22dd;">(</span><span style="color: #531ab6;">with-temp-buffer</span>
    <span style="color: #008899;">(</span>insert-file-contents file<span style="color: #008899;">)</span>
    <span style="color: #008899;">(</span>org-mode<span style="color: #008899;">)</span>
    <span style="color: #008899;">(</span>spike-leung/get-org-keyword <span style="color: #3548cf;">"DATE"</span><span style="color: #008899;">)</span><span style="color: #dd22dd;">)</span><span style="color: #000000;">)</span>


<span style="color: #000000;">(</span><span style="color: #531ab6;">defun</span> <span style="color: #721045;">spike-leung/sitemap-format-entry</span> <span style="color: #dd22dd;">(</span>entry style project<span style="color: #dd22dd;">)</span>
  <span style="color: #2a5045;">"&#33258;&#23450;&#20041;&#32593;&#31449;&#22320;&#22270;&#26465;&#30446;&#26684;&#24335;&#65292;&#28155;&#21152;&#26085;&#26399;&#20449;&#24687;&#12290;"</span>
  <span style="color: #dd22dd;">(</span><span style="color: #531ab6;">let*</span> <span style="color: #008899;">(</span><span style="color: #972500;">(</span>filename <span style="color: #808000;">(</span>org-publish--expand-file-name entry project<span style="color: #808000;">)</span><span style="color: #972500;">)</span>
         <span style="color: #972500;">(</span>date <span style="color: #808000;">(</span>spike-leung/org-publish-find-date filename project<span style="color: #808000;">)</span><span style="color: #972500;">)</span><span style="color: #008899;">)</span>
    <span style="color: #008899;">(</span>format <span style="color: #3548cf;">"%s %s"</span>
            <span style="color: #972500;">(</span>org-publish-sitemap-default-entry entry style project<span style="color: #972500;">)</span>
            <span style="color: #972500;">(</span><span style="color: #531ab6;">if</span> date
                date
              <span style="color: #3548cf;">"long time ago..."</span><span style="color: #972500;">)</span><span style="color: #008899;">)</span><span style="color: #dd22dd;">)</span><span style="color: #000000;">)</span>


<span style="color: #969896;">;; </span><span style="color: #7f0000;">@see: https://writepermission.com/org-blogging-rss-feed.html</span>
<span style="color: #000000;">(</span><span style="color: #531ab6;">defun</span> <span style="color: #721045;">rw/org-rss-publish-to-rss</span> <span style="color: #dd22dd;">(</span>plist filename pub-dir<span style="color: #dd22dd;">)</span>
  <span style="color: #2a5045;">"Publish RSS with PLIST, only when FILENAME is '</span><span style="color: #0000b0;">rss.org</span><span style="color: #2a5045;">'.</span>
<span style="color: #2a5045;">PUB-DIR is when the output will be placed."</span>
  <span style="color: #dd22dd;">(</span><span style="color: #531ab6;">if</span> <span style="color: #008899;">(</span>equal <span style="color: #3548cf;">"rss.org"</span> <span style="color: #972500;">(</span>file-name-nondirectory filename<span style="color: #972500;">)</span><span style="color: #008899;">)</span>
      <span style="color: #008899;">(</span>org-rss-publish-to-rss plist filename pub-dir<span style="color: #008899;">)</span><span style="color: #dd22dd;">)</span><span style="color: #000000;">)</span>


<span style="color: #000000;">(</span><span style="color: #531ab6;">defun</span> <span style="color: #721045;">rw/format-rss-feed</span> <span style="color: #dd22dd;">(</span>title list<span style="color: #dd22dd;">)</span>
  <span style="color: #2a5045;">"Generate RSS feed as a string.</span>
<span style="color: #2a5045;">TITLE is the RSS feed title and LIST contains files to include."</span>
  <span style="color: #dd22dd;">(</span>concat <span style="color: #3548cf;">"#+TITLE: "</span> title <span style="color: #3548cf;">"</span><span style="color: #721045;">\</span><span style="color: #00663f;">n</span><span style="color: #721045;">\</span><span style="color: #00663f;">n</span><span style="color: #3548cf;">"</span> <span style="color: #008899;">(</span>org-list-to-subtree list<span style="color: #008899;">)</span><span style="color: #dd22dd;">)</span><span style="color: #000000;">)</span>


<span style="color: #000000;">(</span><span style="color: #531ab6;">defun</span> <span style="color: #721045;">rw/format-rss-feed-entry</span> <span style="color: #dd22dd;">(</span>entry style project<span style="color: #dd22dd;">)</span>
  <span style="color: #2a5045;">"Format ENTRY for the RSS feed.</span>
<span style="color: #2a5045;">ENTRY is a file name.  STYLE is either '</span><span style="color: #0000b0;">list</span><span style="color: #2a5045;">' or '</span><span style="color: #0000b0;">tree</span><span style="color: #2a5045;">'.</span>
<span style="color: #2a5045;">PROJECT is the current project."</span>
  <span style="color: #dd22dd;">(</span><span style="color: #531ab6;">cond</span> <span style="color: #008899;">(</span><span style="color: #972500;">(</span>not <span style="color: #808000;">(</span>directory-name-p entry<span style="color: #808000;">)</span><span style="color: #972500;">)</span>
         <span style="color: #972500;">(</span><span style="color: #531ab6;">let*</span> <span style="color: #808000;">(</span><span style="color: #531ab6;">(</span>title <span style="color: #008900;">(</span>org-publish-find-title entry project<span style="color: #008900;">)</span><span style="color: #531ab6;">)</span>
                <span style="color: #531ab6;">(</span>date <span style="color: #008900;">(</span>format-time-string <span style="color: #3548cf;">"%Y-%m-%d"</span> <span style="color: #3548cf;">(</span>org-publish-find-date entry project<span style="color: #3548cf;">)</span><span style="color: #008900;">)</span><span style="color: #531ab6;">)</span>
                <span style="color: #531ab6;">(</span>link <span style="color: #008900;">(</span>concat <span style="color: #3548cf;">(</span>file-name-sans-extension entry<span style="color: #3548cf;">)</span> <span style="color: #3548cf;">".html"</span><span style="color: #008900;">)</span><span style="color: #531ab6;">)</span><span style="color: #808000;">)</span>
           <span style="color: #808000;">(</span><span style="color: #531ab6;">with-temp-buffer</span>
             <span style="color: #531ab6;">(</span>insert <span style="color: #008900;">(</span>format <span style="color: #3548cf;">"%s</span><span style="color: #721045;">\</span><span style="color: #00663f;">n</span><span style="color: #3548cf;">"</span> title<span style="color: #008900;">)</span><span style="color: #531ab6;">)</span>
             <span style="color: #531ab6;">(</span>insert <span style="color: #3548cf;">":PROPERTIES:</span><span style="color: #721045;">\</span><span style="color: #00663f;">n</span><span style="color: #3548cf;">:RSS_PERMALINK: "</span> link <span style="color: #3548cf;">"</span><span style="color: #721045;">\</span><span style="color: #00663f;">n</span><span style="color: #3548cf;">:PUBDATE: "</span> date <span style="color: #3548cf;">"</span><span style="color: #721045;">\</span><span style="color: #00663f;">n</span><span style="color: #3548cf;">:END:</span><span style="color: #721045;">\</span><span style="color: #00663f;">n</span><span style="color: #3548cf;">"</span><span style="color: #531ab6;">)</span>
             <span style="color: #531ab6;">(</span>insert <span style="color: #008900;">(</span>format <span style="color: #3548cf;">"%s"</span> title<span style="color: #008900;">)</span><span style="color: #531ab6;">)</span>
             <span style="color: #531ab6;">(</span>buffer-string<span style="color: #531ab6;">)</span><span style="color: #808000;">)</span>
           <span style="color: #972500;">)</span><span style="color: #008899;">)</span>
        <span style="color: #008899;">(</span><span style="color: #972500;">(</span>eq style <span style="color: #531ab6;">'</span><span style="color: #0000b0;">tree</span><span style="color: #972500;">)</span>
         <span style="color: #969896;">;; </span><span style="color: #7f0000;">Return only last subdir.</span>
         <span style="color: #972500;">(</span>file-name-nondirectory <span style="color: #808000;">(</span>directory-file-name entry<span style="color: #808000;">)</span><span style="color: #972500;">)</span><span style="color: #008899;">)</span>
        <span style="color: #008899;">(</span>t entry<span style="color: #008899;">)</span><span style="color: #dd22dd;">)</span><span style="color: #000000;">)</span>

<span style="color: #000000;">(</span><span style="color: #531ab6;">defconst</span> <span style="color: #005e8b;">spike-leung/html-head</span> <span style="color: #3548cf;">"</span>
<span style="color: #3548cf;">&lt;link rel=</span><span style="color: #721045;">\</span><span style="color: #00663f;">"</span><span style="color: #3548cf;">stylesheet</span><span style="color: #721045;">\</span><span style="color: #00663f;">"</span><span style="color: #3548cf;"> href=</span><span style="color: #721045;">\</span><span style="color: #00663f;">"</span><span style="color: #3548cf;">../styles/style.css</span><span style="color: #721045;">\</span><span style="color: #00663f;">"</span><span style="color: #3548cf;"> type=</span><span style="color: #721045;">\</span><span style="color: #00663f;">"</span><span style="color: #3548cf;">text/css</span><span style="color: #721045;">\</span><span style="color: #00663f;">"</span><span style="color: #3548cf;">/&gt;</span>
<span style="color: #3548cf;">&lt;link rel=</span><span style="color: #721045;">\</span><span style="color: #00663f;">"</span><span style="color: #3548cf;">icon</span><span style="color: #721045;">\</span><span style="color: #00663f;">"</span><span style="color: #3548cf;"> href=</span><span style="color: #721045;">\</span><span style="color: #00663f;">"</span><span style="color: #3548cf;">/favicon.ico</span><span style="color: #721045;">\</span><span style="color: #00663f;">"</span><span style="color: #3548cf;"> type=</span><span style="color: #721045;">\</span><span style="color: #00663f;">"</span><span style="color: #3548cf;">image/x-icon</span><span style="color: #721045;">\</span><span style="color: #00663f;">"</span><span style="color: #3548cf;">&gt;</span>
<span style="color: #3548cf;">"</span>
  <span style="color: #2a5045;">"`</span><span style="color: #0000b0;">:html-head</span><span style="color: #2a5045;">' for `</span><span style="color: #0000b0;">org-publish</span><span style="color: #2a5045;">'."</span><span style="color: #000000;">)</span>

<span style="color: #000000;">(</span><span style="color: #531ab6;">defconst</span> <span style="color: #005e8b;">spike-leung/html-preamble</span> <span style="color: #3548cf;">"</span>
<span style="color: #3548cf;"> &lt;nav&gt;</span>
<span style="color: #3548cf;">  &lt;ul&gt;</span>
<span style="color: #3548cf;">    &lt;li&gt;&lt;a href=</span><span style="color: #721045;">\</span><span style="color: #00663f;">"</span><span style="color: #3548cf;">/index.html</span><span style="color: #721045;">\</span><span style="color: #00663f;">"</span><span style="color: #3548cf;">&gt;Home&lt;/a&gt;&lt;/li&gt;</span>
<span style="color: #3548cf;">    &lt;li&gt;&lt;a href=</span><span style="color: #721045;">\</span><span style="color: #00663f;">"</span><span style="color: #3548cf;">/about.html</span><span style="color: #721045;">\</span><span style="color: #00663f;">"</span><span style="color: #3548cf;">&gt;About&lt;/a&gt;&lt;/li&gt;</span>
<span style="color: #3548cf;">    &lt;li&gt;&lt;a href=</span><span style="color: #721045;">\</span><span style="color: #00663f;">"</span><span style="color: #3548cf;">/rss.xml</span><span style="color: #721045;">\</span><span style="color: #00663f;">"</span><span style="color: #3548cf;">&gt;RSS&lt;/a&gt;&lt;/li&gt;</span>
<span style="color: #3548cf;">    &lt;li&gt;&lt;a href=</span><span style="color: #721045;">\</span><span style="color: #00663f;">"</span><span style="color: #3548cf;">https://github.com/Spike-Leung/taxodium/tree/org-publish</span><span style="color: #721045;">\</span><span style="color: #00663f;">"</span><span style="color: #3548cf;">&gt;GitHub&lt;/a&gt;&lt;/li&gt;</span>
<span style="color: #3548cf;">  &lt;/ul&gt;</span>
<span style="color: #3548cf;">&lt;/nav&gt;</span>
<span style="color: #3548cf;">"</span>
  <span style="color: #2a5045;">"`</span><span style="color: #0000b0;">:html-preamble</span><span style="color: #2a5045;">' for `</span><span style="color: #0000b0;">org-publish</span><span style="color: #2a5045;">'."</span> <span style="color: #000000;">)</span>

<span style="color: #000000;">(</span><span style="color: #531ab6;">defconst</span> <span style="color: #005e8b;">spike-lenng/html-postamble</span> <span style="color: #3548cf;">"</span>
<span style="color: #3548cf;">&lt;p class=</span><span style="color: #721045;">\</span><span style="color: #00663f;">"</span><span style="color: #3548cf;">author</span><span style="color: #721045;">\</span><span style="color: #00663f;">"</span><span style="color: #3548cf;">&gt;Author: &lt;a href=</span><span style="color: #721045;">\</span><span style="color: #00663f;">"</span><span style="color: #3548cf;">mailto:l-yanlei@hotmail.com</span><span style="color: #721045;">\</span><span style="color: #00663f;">"</span><span style="color: #3548cf;">&gt;%a&lt;/a&gt;&lt;/p&gt;</span>
<span style="color: #3548cf;">&lt;p class=</span><span style="color: #721045;">\</span><span style="color: #00663f;">"</span><span style="color: #3548cf;">date</span><span style="color: #721045;">\</span><span style="color: #00663f;">"</span><span style="color: #3548cf;">&gt;Date: %d&lt;/p&gt;</span>
<span style="color: #3548cf;">&lt;p class=</span><span style="color: #721045;">\</span><span style="color: #00663f;">"</span><span style="color: #3548cf;">license</span><span style="color: #721045;">\</span><span style="color: #00663f;">"</span><span style="color: #3548cf;">&gt;License: &lt;a href=</span><span style="color: #721045;">\</span><span style="color: #00663f;">"</span><span style="color: #3548cf;">https://www.creativecommons.org/licenses/by-nc/4.0/deed.zh-hans</span><span style="color: #721045;">\</span><span style="color: #00663f;">"</span><span style="color: #3548cf;">&gt;CC BY-NC 4.0&lt;/a&gt;&lt;/p&gt;</span>
<span style="color: #3548cf;">&lt;script src=</span><span style="color: #721045;">\</span><span style="color: #00663f;">"</span><span style="color: #3548cf;">https://utteranc.es/client.js</span><span style="color: #721045;">\</span><span style="color: #00663f;">"</span><span style="color: #3548cf;"> repo=</span><span style="color: #721045;">\</span><span style="color: #00663f;">"</span><span style="color: #3548cf;">Spike-Leung/taxodium</span><span style="color: #721045;">\</span><span style="color: #00663f;">"</span><span style="color: #3548cf;"> issue-term=</span><span style="color: #721045;">\</span><span style="color: #00663f;">"</span><span style="color: #3548cf;">pathname</span><span style="color: #721045;">\</span><span style="color: #00663f;">"</span><span style="color: #3548cf;"> theme=</span><span style="color: #721045;">\</span><span style="color: #00663f;">"</span><span style="color: #3548cf;">github-light</span><span style="color: #721045;">\</span><span style="color: #00663f;">"</span><span style="color: #3548cf;"> crossorigin=</span><span style="color: #721045;">\</span><span style="color: #00663f;">"</span><span style="color: #3548cf;">anonymous</span><span style="color: #721045;">\</span><span style="color: #00663f;">"</span><span style="color: #3548cf;"> async&gt;&lt;/script&gt;</span>
<span style="color: #3548cf;">"</span>
  <span style="color: #2a5045;">"`</span><span style="color: #0000b0;">:html-postamble</span><span style="color: #2a5045;">' for `</span><span style="color: #0000b0;">org-publish</span><span style="color: #2a5045;">'."</span><span style="color: #000000;">)</span>



<span style="color: #000000;">(</span><span style="color: #531ab6;">setq</span> org-publish-project-alist
      <span style="color: #531ab6;">`</span><span style="color: #dd22dd;">(</span><span style="color: #008899;">(</span><span style="color: #3548cf;">"orgfiles"</span>
         <span style="color: #8f0075;">:base-directory</span> <span style="color: #3548cf;">"~/git/taxodium/post"</span>
         <span style="color: #8f0075;">:base-extension</span> <span style="color: #3548cf;">"org"</span>
         <span style="color: #8f0075;">:publishing-directory</span> <span style="color: #3548cf;">"~/git/taxodium/publish"</span>
         <span style="color: #8f0075;">:publishing-function</span> org-html-publish-to-html
         <span style="color: #8f0075;">:section-numbers</span> nil
         <span style="color: #8f0075;">:with-toc</span> t
         <span style="color: #8f0075;">:with-tags</span> t
         <span style="color: #8f0075;">:time-stamp-file</span> nil
         <span style="color: #8f0075;">:html-head</span> ,spike-leung/html-head
         <span style="color: #8f0075;">:html-preamble</span> ,spike-leung/html-preamble
         <span style="color: #8f0075;">:html-postamble</span> ,spike-lenng/html-postamble
         <span style="color: #8f0075;">:exclude</span> <span style="color: #3548cf;">"rss.org"</span>
         <span style="color: #8f0075;">:auto-sitemap</span> t
         <span style="color: #8f0075;">:sitemap-filename</span> <span style="color: #3548cf;">"index.org"</span>
         <span style="color: #8f0075;">:sitemap-title</span> <span style="color: #3548cf;">"Taxodium"</span>
         <span style="color: #8f0075;">:sitemap-format-entry</span> spike-leung/sitemap-format-entry
         <span style="color: #8f0075;">:sitemap-sort-files</span> anti-chronologically
         <span style="color: #8f0075;">:author</span> <span style="color: #3548cf;">"Spike Leung"</span>
         <span style="color: #8f0075;">:email</span> <span style="color: #3548cf;">"l-yanlei@hotmail.com"</span><span style="color: #008899;">)</span>

        <span style="color: #008899;">(</span><span style="color: #3548cf;">"sitemap"</span>
         <span style="color: #8f0075;">:base-directory</span> <span style="color: #3548cf;">"~/git/taxodium/post"</span>
         <span style="color: #8f0075;">:base-extension</span> <span style="color: #3548cf;">"org"</span>
         <span style="color: #8f0075;">:publishing-directory</span> <span style="color: #3548cf;">"~/git/taxodium/publish"</span>
         <span style="color: #8f0075;">:publishing-function</span> org-html-publish-to-html
         <span style="color: #8f0075;">:time-stamp-file</span> nil
         <span style="color: #8f0075;">:html-head</span> ,spike-leung/html-head
         <span style="color: #8f0075;">:html-preamble</span> ,spike-leung/html-preamble
         <span style="color: #8f0075;">:include</span> <span style="color: #972500;">(</span><span style="color: #3548cf;">"index.org"</span><span style="color: #972500;">)</span>
         <span style="color: #8f0075;">:exclude</span> <span style="color: #3548cf;">".*"</span>
         <span style="color: #8f0075;">:html-postamble</span> nil<span style="color: #008899;">)</span>

        <span style="color: #008899;">(</span><span style="color: #3548cf;">"rss"</span>
         <span style="color: #8f0075;">:base-directory</span> <span style="color: #3548cf;">"~/git/taxodium/post"</span>
         <span style="color: #8f0075;">:base-extension</span> <span style="color: #3548cf;">"org"</span>
         <span style="color: #8f0075;">:exclude</span> <span style="color: #3548cf;">"about</span><span style="color: #721045;">\</span><span style="color: #00663f;">\</span><span style="color: #00663f;">|</span><span style="color: #3548cf;">index"</span>
         <span style="color: #8f0075;">:publishing-directory</span> <span style="color: #3548cf;">"~/git/taxodium/publish"</span>
         <span style="color: #8f0075;">:publishing-function</span> rw/org-rss-publish-to-rss
         <span style="color: #8f0075;">:html-postamble</span> nil
         <span style="color: #8f0075;">:section-numbers</span> nil
         <span style="color: #8f0075;">:with-toc</span> nil
         <span style="color: #8f0075;">:rss-extension</span> <span style="color: #3548cf;">"xml"</span>
         <span style="color: #8f0075;">:html-link-home</span> <span style="color: #3548cf;">"https://taxodium.ink"</span>
         <span style="color: #8f0075;">:html-link-use-abs-url</span> t
         <span style="color: #8f0075;">:auto-sitemap</span> t
         <span style="color: #8f0075;">:sitemap-filename</span> <span style="color: #3548cf;">"rss.org"</span>
         <span style="color: #8f0075;">:sitemap-title</span> <span style="color: #3548cf;">"Taxodium"</span>
         <span style="color: #8f0075;">:sitemap-sort-files</span> anti-chronologically
         <span style="color: #8f0075;">:sitemap-function</span> rw/format-rss-feed
         <span style="color: #8f0075;">:sitemap-format-entry</span> rw/format-rss-feed-entry
         <span style="color: #8f0075;">:author</span> <span style="color: #3548cf;">"Spike Leung"</span>
         <span style="color: #8f0075;">:email</span> <span style="color: #3548cf;">"l-yanlei@hotmail.com"</span><span style="color: #008899;">)</span>

        <span style="color: #008899;">(</span><span style="color: #3548cf;">"website"</span> <span style="color: #8f0075;">:components</span> <span style="color: #972500;">(</span><span style="color: #3548cf;">"orgfiles"</span> <span style="color: #3548cf;">"sitemap"</span> <span style="color: #3548cf;">"rss"</span><span style="color: #972500;">)</span><span style="color: #008899;">)</span><span style="color: #dd22dd;">)</span><span style="color: #000000;">)</span>

<span style="color: #000000;">(</span><span style="color: #531ab6;">provide</span> <span style="color: #531ab6;">'</span><span style="color: #0000b0;">init-org-publish</span><span style="color: #000000;">)</span>
<span style="color: #969896;">;;; </span><span style="color: #7f0000;">init-org-publish.el ends here</span>
</pre>
</div>
</details>
</div>
</div>
